export const Pile_Type_Enum = [
  {
    value: "FRICTION",
    label: "摩擦桩",
  },
  {
    value: "SOCKETED",
    label: "嵌岩桩",
  },
]

export const Drill_Mode_Enum = [
  {
    value: "MANUAL_HOLE_DIGGING",
    label: "人工挖空",
  },
  {
    value: "DRY_CONSTRUCTION_DRILL",
    label: "干作业钻孔",
  },
  {
    value: "MUD_PROTECTION_DRILL",
    label: "泥浆护壁钻孔",
  },
  {
    value: "CASING_PIPE_WALL_DRILL",
    label: "套管护壁钻孔",
  },
  {
    value: "IMMERSED_TUBE_DRILL",
    label: "沉管",
  },
]

export const Connect_method_enum = [
  {
    value: "MACHINE",
    label: "机械连接",
  },
  {
    value: "WELD",
    label: "焊接连接",
  },
  {
    value: "LASHED",
    label: "绑扎搭接",
  },
]

export const PILE_CODE = [
  "030101010102010701",
  "030101010102010702",
  "030101010101010701",
  "030101010101010702",
  "030102010101010701",
  "030102010101010702",
  "03010301010101010701",
  "03010301010101010702",
  "03020101010101010701",
  "03020101010101010702",
  "03020102010101010701",
  "03020102010101010702",
  "03020103010101010701",
  "03020103010101010702",
  "03020201010101010701",
  "03020201010101010702",
  "03020201020101010701",
  "03020201020101010702",
  "030301010101010701",
  "030301010101010702",
  "030301020101010701",
  "030301020101010702",
  "030302010101010701",
  "030302010101010702",
  "030302020101010701",
  "030302020101010702",
  "030401010101010701",
  "030401010101010702",
  "030401020101010701",
  "030401020101010702",
  "030402010101010701",
  "030402010101010702",
  "030402020101010701",
  "030402020101010702",
]

export const FILE_NAME = [
  "01(申)钻孔报验申请表.xlsx",
  "02(记)钢护筒安装质量检验记录表.xlsx",
  "03(记)钻孔桩钻孔及清孔记录表.xlsx",
  "04(记)泥浆测试记录表.xlsx",
  "05(记)钻孔桩成孔检查表.xlsx",
  "06(检)钻孔检验批质量验收记录表.xlsx",
  "07(申)钻孔桩钢筋报验申请表.xlsx",
  "08(检)钢筋(原材料及加工)检验批质量验收记录表(Ⅰ).xlsx",
  "09(检)钢筋(连接及安装)工程检验批质量验收记录表(Ⅱ).xlsx",
  "10(申)钻孔桩混凝土报验申请表.xlsx",
  "11(检)混凝土(原材料、配合比、拌和、浇筑)检验批质量验收记录表(Ⅰ).xlsx",
  "12(记)钻孔桩内浇筑水下混凝土记录表.xlsx",
  "13(检混凝土(质量检测)检验批质量验收记录表(Ⅱ).xlsx",
]
